#pragma once
#include<stdio.h>
/*
void main()
{
	//컴퓨터는 0 또는 1이라는 숫자로만 이해
	//십진법 : 사람이 사용하는 숫자체계 (0 ~ 9)
	//이진법 : 컴퓨터가 사용하는 숫자체계 (0 ,1)

	//컴파일
	//사람이 이해하는 언어를 컴퓨터가 이해할 수 있는 언어로 바꾸는 과정

	//비트 : 데이터를 저장하기 위한 최소의 단위
	//비트가 8개 모이면 1 바이트
	//한 문자를 나타내기 위한 최소단위

	//AND : 두개의 비트가 모두 1일때 1을 반환하는 연산자
	int X = 7;
	int Y = 9;

	printf("X와 Y를 AND 연산한 결과 : %d\n", X & Y);

	//OR : 두개의 비트중 하나라도 1이 있을때 1을 반환하는 연산자

	printf("X와 Y를 OR 연산한 결과 : %d\n", X | Y);

	//XOR : 두개의 비트가 같으면 0을, 다르면 1을 반환하는 연산자

	printf("X와 Y를 XOR 연산한 결과 : %d\n", X ^ Y);

	//NOT : 하나의 비트를 반전

	printf("X를 NOT 연산한 결과 : %d\n", ~X);
	printf("Y를 NOT 연산한 결과 : %d\n", ~Y);

	//오버플로우 : 특정한 자료형이 표현할 수 있는 최댓값의 범위를 넘어서 연산을 수행하는 과정

	char value = 128;
	printf("value의 값 : %d\n", value);

	//언더플로우 : 특정한 자료형이 표현할 수 있는 최솟값의 범위를 넘어서 연산을 수행하는 과정

	char variable = -129;
	printf("variable의 값 : %d\n", variable);
}
*/